# Taps
tap "cormacrelf/tap"

# CLI tools
brew "atuin"
brew "bat"
brew "btop"
brew "bun"
brew "chezmoi"
brew "dbmate"
brew "difftastic"
brew "direnv"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "jj"
brew "lazydocker"
brew "lazygit"
brew "mosh"
brew "neovim"
brew "ripgrep"
brew "terraform"
brew "tree"
brew "yt-dlp"
brew "zellij"
brew "zoxide"

# Dark mode switching
brew "cormacrelf/tap/dark-notify"

# Casks
cask "1password"
cask "1password-cli"
cask "codex"
cask "calibre"
cask "claude-code"
cask "cursor"
cask "docker-desktop"
cask "ghostty"
cask "raycast"
