# Taps
tap "cormacrelf/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"

# CLI tools
brew "age"
brew "atuin"
brew "bat"
brew "btop"
brew "chezmoi"
brew "dbmate"
brew "difftastic"
brew "direnv"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "imagemagick"
brew "jj"
brew "lazydocker"
brew "lazygit"
brew "lima"
brew "mas"
brew "mise"
brew "mosh"
brew "neovim"
brew "poppler"
brew "ripgrep"
brew "tree"
brew "yt-dlp"
brew "zellij"
brew "zoxide"

# Tapped formulae (fully qualified for brew bundle reliability)
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"

# Dark mode switching (tapped)
brew "cormacrelf/tap/dark-notify"

# Casks
cask "1password"
cask "1password-cli"
cask "calibre"
cask "claude-code"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "ghostty"
cask "hammerspoon"
cask "handy"
cask "raycast"
